#Вычисление суммы чисел: Напишите программу для вычисления суммы чисел от 1 до N.
# императивный стиль
n = 5
sum1 = 0

for i in range(1, n+1):
    sum1 += i
    print("Cevvf xbctl", sum)

# декларативный стиль

n = 5
sum = n * (n + 1) / 2
print( sum )